In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("customer_shopping_behavior.csv")

In [5]:
df.head(5) #this will help me to check the dataset and here you can check the columns and other things

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,Yes,14,Venmo,Fortnightly
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,Yes,2,Cash,Fortnightly
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,Yes,23,Credit Card,Weekly
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,Yes,49,PayPal,Weekly
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,Yes,31,PayPal,Annually

In [8]:
df.info() #this will give the infomation about the non nulls , the data type for each column also if we have null values we need to find a method to impute them,In review rating we can see few null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 18 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer ID             3900 non-null   int64
 1   Age                     3900 non-null   int64
 2   Gender                  3900 non-null   object
 3   Item Purchased          3900 non-null   object
 4   Category                3900 non-null   object
 5   Purchase Amount (USD)   3900 non-null   int64
 6   Location                3900 non-null   object
 7   Size                    3900 non-null   object
 8   Color                   3900 non-null   object
 9   Season                  3900 non-null   object
 10  Review Rating           3863 non-null   float64
 11  Subscription Status     3900 non-null   object
 12  Shipping Type           3900 non-null   object
 13  Discount Applied        3900 non-null   object
 14  Promo Code Used         3900 non-null   object
 15  Previous Purchases      3900 non-null   int64
 16  Payment Method          3900 non-null   object
 17  Frequency of Purchases  3900 non-null   object
dtypes: float64(1), int64(4), object(13)
memory usage: 548.6+ KB

In [10]:
df.describe() #this will give me the statistics of numerical columns

,Customer ID,Age,Purchase Amount (USD),Review Rating,Previous Purchases
count,3900.000000,3900.000000,3900.000000,3863.000000,3900.000000
mean,1950.500000,44.068462,59.764359,3.750065,25.351538
std,1125.977353,15.207589,23.685392,0.716983,14.447125
min,1.000000,18.000000,20.000000,2.500000,1.000000
25%,975.750000,31.000000,39.000000,3.100000,13.000000
50%,1950.500000,44.000000,60.000000,3.800000,25.000000
75%,2925.250000,57.000000,81.000000,4.400000,38.000000
max,3900.000000,70.000000,100.000000,5.000000,50.000000

In [12]:
df.describe(include='all') #this will include all the categorical and numerical columns

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
count,3900.000000,3900.000000,3900,3900,3900,3900.000000,3900,3900,3900,3900,3863.000000,3900,3900,3900,3900,3900.000000,3900,3900
unique,NaN,NaN,2,25,4,NaN,50,4,25,4,NaN,2,6,2,2,NaN,6,7
top,NaN,NaN,Male,Blouse,Clothing,NaN,Montana,M,Olive,Spring,NaN,No,Free Shipping,No,No,NaN,PayPal,Every 3 Months
freq,NaN,NaN,2652,171,1737,NaN,96,1755,177,999,NaN,2847,675,2223,2223,NaN,677,584
mean,1950.500000,44.068462,NaN,NaN,NaN,59.764359,NaN,NaN,NaN,NaN,3.750065,NaN,NaN,NaN,NaN,25.351538,NaN,NaN
std,1125.977353,15.207589,NaN,NaN,NaN,23.685392,NaN,NaN,NaN,NaN,0.716983,NaN,NaN,NaN,NaN,14.447125,NaN,NaN
min,1.000000,18.000000,NaN,NaN,NaN,20.000000,NaN,NaN,NaN,NaN,2.500000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,975.750000,31.000000,NaN,NaN,NaN,39.000000,NaN,NaN,NaN,NaN,3.100000,NaN,NaN,NaN,NaN,13.000000,NaN,NaN
50%,1950.500000,44.000000,NaN,NaN,NaN,60.000000,NaN,NaN,NaN,NaN,3.800000,NaN,NaN,NaN,NaN,25.000000,NaN,NaN
75%,2925.250000,57.000000,NaN,NaN,NaN,81.000000,NaN,NaN,NaN,NaN,4.400000,NaN,NaN,NaN,NaN,38.000000,NaN,NaN
max,3900.000000,70.000000,NaN,NaN,NaN,100.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN,NaN,NaN,50.000000,NaN,NaN

In [14]:
df.isnull().sum() #this will give us the count of the null values and now we have to find a way to delete

Customer ID                0
Age                        0
Gender                     0
Item Purchased             0
Category                   0
Purchase Amount (USD)      0
Location                   0
Size                       0
Color                      0
Season                     0
Review Rating             37
Subscription Status        0
Shipping Type              0
Discount Applied           0
Promo Code Used            0
Previous Purchases         0
Payment Method             0
Frequency of Purchases     0
dtype: int64

### Approaches to handle nulls
1) We can remove the rows which are having null values but removing anything from data can affect our insights so may not be the good approach
2) We can impute the values with the mean and median. Going ahead with mean is not a preferable choice as mean is affected by outliers so can introduce a bias in our dataset. Median is more robust as it is the count of freequency of an item existing multiple times and is immune to outliers.

But here we have different categories of data so directly taking median of all of them together will also bring some bias and reviews rating is very important insights. So we will find the median for each category and then impute it with the missing values of each category

In [15]:
df['Review Rating']=df.groupby('Category')["Review Rating"].transform(lambda x:x.fillna(x.median()))

### How above code works
groupby() does NOT immediately change how the DataFrame looks.
Instead, it creates a GroupBy object (a logical split of data).
Think of it as:
1) GroupBy object
 ‚îú‚îÄ‚îÄ Electronics group
 ‚îî‚îÄ‚îÄ Clothing group

Electronics Group:
| Index | Category     | Review Rating |
|------:|-------------|---------------|
| 0     | Electronics | 4.5           |
| 1     | Electronics | NaN           |
| 4     | Electronics | 4.2           |

Clothing Group
| Index | Category | Review Rating |
|------:|----------|---------------|
| 2     | Clothing | 3.8           |
| 3     | Clothing | NaN           |
| 5     | Clothing | 4.0           |

df.groupby('Category')['Review Rating']

This become a series
Index
0    4.5
1    NaN
4    4.2
Name: Review Rating

Index
2    3.8
3    NaN
5    4.0
Name: Review Rating

In [17]:
#changing the name of columns. The name of the columns that we have are little inconsistent so we need to make sure that the names are consistent when we work with them in the SQL it should be easy for us to do that
print(df.columns) #this is the way in which you can access the columns

Index(['Customer ID', 'Age', 'Gender', 'Item Purchased', 'Category',
       'Purchase Amount (USD)', 'Location', 'Size', 'Color', 'Season',
       'Review Rating', 'Subscription Status', 'Shipping Type',
       'Discount Applied', 'Promo Code Used', 'Previous Purchases',
       'Payment Method', 'Frequency of Purchases'],
      dtype='object')

In [18]:
df.columns=df.columns.str.lower()
df.columns=df.columns.str.replace(' ','_')

In [19]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount_(usd)', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [24]:
#Now you can see all the columns but purchase id column is not as per expectations
df=df.rename(columns={'purchase_amount_(usd)':'purchase_amount'})
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

### Note for the below
You can rename multiple columns as below
df = df.rename(columns={
    'purchase_amount_(usd)': 'purchase_amount',
    'review_rating_(out_of_5)': 'review_rating',
    'user_id_(internal)': 'user_id'
})

In [28]:
#create a column age group
labels=['Young_Adult','Adult','Middle-aged','Senior'] #this is a list of all the different categories
df['age_group']=pd.qcut(df['age'],q=4,labels=labels) #this is a way we are introducing new column

### Qcut and its explanantion

Sort all values in df['age']

Split them into 4 equal-sized groups

Each group has ~25% of the rows

Assign labels in order:

Lowest 25% values ‚Üí Young_Adult

Next 25% ‚Üí Adult

Next 25% ‚Üí Middle-aged

Highest 25% ‚Üí Senior

While we can go ahead with this but this might fail if our min and max range in the age is between 18-30 so 30 can't be considered senior so for that we should take pd.cut

In [30]:
df[['age','age_group']].head(10) #we have made these groups to understand the buying patterns age wise

   age    age_group
0   55  Middle-aged
1   19  Young_Adult
2   50  Middle-aged
3   21  Young_Adult
4   45  Middle-aged
5   46  Middle-aged
6   63       Senior
7   27  Young_Adult
8   26  Young_Adult
9   57  Middle-aged

In [32]:
#we have a column where we have purchase_freequency_days and the strings are of no use to me as i can't do any analysis for that
freequency_mapping={
    'Fortnightly':14,
    'Weekly':7,
    'Monthly':30,
    'Quarterly':90,
    'Bi-Weekly':14,
    'Annually':365,
    'Every 3 Months':90
}
df['purchase_freequency_days']=df['frequency_of_purchases'].map(freequency_mapping)

In [34]:
df[['purchase_freequency_days','frequency_of_purchases']].head(10)

   purchase_freequency_days frequency_of_purchases
0                        14            Fortnightly
1                        14            Fortnightly
2                         7                 Weekly
3                         7                 Weekly
4                       365               Annually
5                         7                 Weekly
6                        90              Quarterly
7                         7                 Weekly
8                       365               Annually
9                        90              Quarterly

In [35]:
#discount_applied and promo code used needs to be investigated.There can be a case where promo code is not applied and still we are getting the discount so we need to check whether we need both the columns or not
(df['discount_applied']==df['promo_code_used']).all()

True

#### Since all are coming true hence we don't need wither of the column lets remove the promo code column

In [36]:
df=df.drop('promo_code_used',axis=1)

In [37]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age-group', 'age_group',
       'purchase_freequency_days'],
      dtype='object')

### Ways to remove a column using pandas

üîÅ Equivalent ways to do the same thing

1Ô∏è‚É£ Using columns (more readable)
df = df.drop(columns=['promo_code_used'])

2Ô∏è‚É£ Drop in-place (no reassignment)
df.drop('promo_code_used', axis=1, inplace=True) here we don't need any kind of reassignment

3Ô∏è‚É£ Drop multiple columns
df = df.drop(['promo_code_used', 'discount'], axis=1)

In [38]:
!pip install pandas pyodbc sqlalchemy

Requirement already satisfied: pandas in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (2.2.3)
Collecting pyodbc
  Downloading pyodbc-5.3.0-cp312-cp312-win_amd64.whl.metadata (2.8 kB)
Collecting sqlalchemy
  Downloading sqlalchemy-2.0.45-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (from pandas) (2025.1)
Collecting greenlet>=1 (from sqlalchemy)
  Downloading greenlet-3.3.0-cp312-cp312-win_amd64.whl.metadata (4.2 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: six>=1.5 in c:\users\ahuja\anaconda3\envs\100daysofmachine\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pyodbc-5.3.0-cp312-cp312-win_amd64.whl (70 kB)
Downloading sqlalchemy-2.0.45-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---- ----------------------------------- 0.3/2.1 MB ? eta -:--:--
   --------- ------------------------------ 0.5/2.1 MB 1.5 MB/s eta 0:00:02
   ------------------- -------------------- 1.0/2.1 MB 1.7 MB/s eta 0:00:01
   ------------------------ --------------- 1.3/2.1 MB 1.8 MB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 1.8 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 1.8 MB/s eta 0:00:00
Downloading greenlet-3.3.0-cp312-cp312-win_amd64.whl (301 kB)
Installing collected packages: pyodbc, greenlet, sqlalchemy
Successfully installed greenlet-3.3.0 pyodbc-5.3.0 sqlalchemy-2.0.45

In [48]:
from sqlalchemy import create_engine
import pyodbc
conn_str = (
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER= DESKTOP-VHK76JQ\\SQLEXPRESS;"
    "DATABASE=customer_behaviour;"
    "Trusted_Connection=yes;"
)

try:
    conn = pyodbc.connect(conn_str)
    print("‚úÖ pyodbc connection successful!")
except Exception as e:
    print("‚ùå pyodbc connection failed:")
    print(e)

‚úÖ pyodbc connection successful!

In [51]:
import urllib.parse
from sqlalchemy import create_engine, text

params = urllib.parse.quote_plus(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=DESKTOP-VHK76JQ\\SQLEXPRESS;"
    "DATABASE=customer_behaviour;"
    "Trusted_Connection=yes;"
)

In [52]:
engine = create_engine(
    f"mssql+pyodbc:///?odbc_connect={params}"
)

In [53]:
try:
    with engine.connect() as conn:
        conn.execute(text("SELECT 1"))
        print("‚úÖ SQLAlchemy connection successful!")
except Exception as e:
    print("‚ùå SQLAlchemy connection failed:")
    print(e)

‚úÖ SQLAlchemy connection successful!

In [54]:
df.to_sql(
    name="customer",
    con=engine,
    if_exists="replace",  # creates table
    index=False
)

print("‚úÖ Data loaded successfully into SQL Server")

‚úÖ Data loaded successfully into SQL Server